<?php
/**
 *
 * @author k.vagin
 */

function _parse2($s)
{
	#исправляем русские буквы (похожие на латинские) с рядом стоящими цифрами на латинские
	#например, это м.б. каталожные номера автозапчастей, в которых есть русские буквы: 1500A023, 52511-60900-H0, K2305, XA527672
	#корректно обрабатываем вхождения '1-ое', 'Ту-134', 'А19-3107/06-43-Ф02-4227/06-С1'
	if (version_compare(PHP_VERSION, '5.2.0', '>='))
	{
		return preg_replace_callback('~(?: (?<=[^-_/]|^)
                                               (?:' . $this->ru_similar . ')++
                                               (?= (?:' . $this->en . '|[-_/])*+ (?<=[^-_/]|' . $this->en . '[-_/])
                                                   \d [\d-_/]*+ (?!' . $this->tt_uniq . ')
                                               )
                                             | (?<=[^-_/]|^)
                                               \d  (?:' . $this->en . '|[-_/])*+ (?<=[^-_/]|' . $this->en . '[-_/])
                                               \K
                                               (?:' . $this->ru_similar . ')++
                                               (?= [\d-_/]*+ (?!' . $this->tt_uniq . ') )
                                           )
                                          ~sxSX', array(&$this, '_entry'), $s);
	}
}